<script setup>
    
</script>

<template>
    <div id="poster">
        <div id="post-content">

            <h1><a href="/" rel="bookmark"></a></h1>

            <div class="entry">

                <p style="text-align: center;"><strong>2SQL.ru &#8212; информационный ресурс о SQL, призванный помочь
                        всем
                        желающим разобраться и овладеть этим языком на хорошем уровне. На этом сайте вы сможете найти
                        информацию
                        об операторах и функциях языка SQL, а так же его функциональных возможностях и применении в
                        различных
                        СУБД.</strong></p>
                <p>Краткая справка о языке и синтаксисе:</p>
                <p>SQL (от англ. Structured Quary Language &#8212; язык структурированных запросов) &#8212;
                    универсальный
                    компьютерный язык управления данными в системах управления базами данных (СУБД) основанных на
                    реляционной
                    модели. SQL является непроцедурным языком. Это значит то, что на языке можно описать манипуляции с
                    данными, но проинструктировать, как ему это сделать нельзя, так как в языке отсутствуют свойственные
                    алгоритмическим языкам конструкции, такие как метки, условные переходы, операторы цикла и др.</p>
                <p>Изучив SQL вы обретете навыки необходимые для работы с информацией в любой реляционной базе данных.
                    Понимание языка помогает проектировать сложные, вложенные запросы, обеспечит знания, необходимые для
                    исследования сложных случаев и возникающих проблем.</p>
                <p>Так как SQL универсален для любых платформ систем управления базами данных, то полученные знания вы
                    сможете использовать в рамках самых разнообразных платформ. SQL неизбежно продолжит свое развитие,
                    чтобы
                    удовлетворять вновь возникающим потребностям рынка и разработчикам программного обеспечения.</p>
                <table border="1" cellspacing="0">
                    <tbody>
                        <tr>
                            <td>
                                <p> На сайте используется подсветка синтаксиса запросов языка SQL. Так, например,
                                    ключевые
                                    слова
                                    операторов выглядят следующим образом:</p>
                                <pre class="brush: sql; title: ; notranslate" title="">
    SELECT, INSERT, UPDATE, DELETE, WHERE
    </pre>
                                <p>Ключевые слова логических операторов и функций, имеют такую подсветку:</p>
                                <pre class="brush: sql; title: ; notranslate" title="">
    LIKE, IN, BETWEEN, ANY, AND, OR
    </pre>
                                <p>Запись выражений, названий столбцов, таблиц, условий оформляется следующим образом:
                                </p>
                                <pre class="brush: sql; title: ; notranslate" title="">
    column_list, table_name, expression, condition
    </pre>
                                <p>Наконец, значения в кавычках выглядят так:</p>
                                <pre class="brush: sql; title: ; notranslate" title="">
    'Moscow', &quot;Saturn&quot;, 'Saint Petersburg'
    </pre>
                            </td>
                        </tr>
                    </tbody>
                </table>
                <p>Все примеры используемые на сайте являются авторскими и были протестированы на СУБД:</p>
                <ul>
                    <li><strong>MS SQL Server</strong> 2008, 2012</li>
                    <li><strong>MySQL</strong> 5.x версий.</li>
                </ul>
                <p>По вопросам, опечаткам на сайте в статьях и примерах используйте ссылку внизу страницы «Обратная
                    связь».
                </p>

            </div>
        </div>
    </div>
</template>